
* Codeoff
** DONE Make users, creation and login.
   :CLOCK:
   CLOCK: [2010-02-22 Mon 16:46]--[2010-02-22 Mon 17:07] =>  0:21
   CLOCK: [2010-02-22 Mon 14:11]--[2010-02-22 Mon 14:58] =>  0:47
   :END:
** TODO Make initial pairing implementation
   :CLOCK:
   CLOCK: [2010-02-22 Mon 23:32]--[2010-02-23 Tue 01:38] =>  2:06
   CLOCK: [2010-02-22 Mon 18:24]--[2010-02-22 Mon 20:14] =>  1:50
   CLOCK: [2010-02-22 Mon 18:08]--[2010-02-22 Mon 18:23] =>  0:15
   :END:
** DONE Make initial database layout
   CLOCK: [2010-02-22 Mon 17:34]--[2010-02-22 Mon 18:08] =>  0:34


** TODO Challenge Off
*** TODO Run Code
*** TODO Return errors
*** TODO Implement winnering
    CLOCK: [2010-02-27 Sat 01:38]--[2010-02-27 Sat 03:49] =>  2:11
**** Recording in database
**** Sending message to loser
*** TODO Problems & Goals
**** TODO Found player needs to return the problem and the goal and then display.
** TODO Create unit tests
*** TODO Create tests for RunPython
    CLOCK: [2010-03-02 Tue 04:07]--[2010-03-02 Tue 04:18] =>  0:11
*** DONE Create fixtures
    CLOCK: [2010-03-02 Tue 03:49]--[2010-03-02 Tue 04:06] =>  0:17

make output windom
problems & goal
